       01 COBCPY01.
           05 EMP-NUM                    PIC X(10).
           05 EMP-FIRST-NM               PIC X(20).
           05 EMP-LAST-NM                PIC X(20).
           05 EMP-PHONE                  PIC X(15).
           05 EMP-ADDRESS                PIC X(50).
           05 FILLER                     PIC X(85).
