 DCL 1 PLICPY01,
       3 EMP_NUM                    CHAR(10),
       3 EMP_FIRST_NM               CHAR(20),
       3 EMP_LAST_NM                CHAR(20),
       3 EMP_PHONE                  CHAR(15),
       3 EMP_ADDRESS                CHAR(50),
       3 FILLER                     CHAR(85);
